emacs_config.org
* Emacs Literate Config
** Notes
After executing tangle, copy the output files to the target
directory and if adding a new section make sure to update
the init.el file in the target directory:

cp -r ./modules/* ~/.config/[target-env]/modules/

Example

cp -r ~/projects/emacs_babel_config/modules/* ~/.config/emacs-prod/modules/
   
* Environment

Defines external environment variables and configurations used across modules.
Manually modify the `active-env` block below to switch between prod/dev environments.

Options emacs-prod | emacs-dev
#+NAME: target-env
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "emacs-prod")
#+END_SRC

#+RESULTS: target-env
: "emacs-prod"

Set target os.

Options archlinux | windows
#+NAME: target-os
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "archlinux")  
#+END_SRC

#+RESULTS: target-os
: "archlinux"

Variable definitions for those variables that can shared across all
modules and enviroments. These should be used judiciously.
All other variable definitions should be within their respective code blocks.
#+NAME: emacs-common-dir
#+BEGIN_SRC emacs-lisp :results value
  (format "\"%s\"" "~/.config/emacs-common")
#+END_SRC

#+RESULTS: emacs-common-dir
: "~/.config/emacs-common"

Set evnrionment variables.
#+BEGIN_SRC emacs-lisp :noweb yes  :tangle ./modules/env.el
  (setq my/env <<target-env()>>)
  (setq server-name <<target-env()>>) 
#+END_SRC

#+RESULTS:
: emacs-prod

Load my API keys.
#+BEGIN_SRC emacs-lisp :noweb yes  :tangle ./modules/env.el
  (load-file (concat <<emacs-common-dir()>> "/api-keys.el"))
#+END_SRC

#+RESULTS:
: t

Starts emacs in server mode.
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  (require 'server)
  (unless (server-running-p)
     (server-start))
#+END_SRC

Turn off yes/no prompt for evaluating org buffer.
#+BEGIN_SRC emacs-lisp  :eval never :tangle ./modules/env.el
  ;; Turn of eval protection
  (setq org-confirm-babel-evaluate nil)
#+END_SRC

Emacs Custom File
#+BEGIN_SRC emacs-lisp :tangle ./modules/env.el
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file 'noerror)
#+END_SRC

#+RESULTS:
: t

* Core

Core emacs configurtation. These setting should be the same across any of my hardware / os
environments (e.g. laptop, desktop, pi).
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/core.el

  ;; Start quiet
  (setq inhibit-startup-screen t
        inhibit-startup-message t
        ring-bell-function #'ignore)

  ;; Files/backups
  (setq make-backup-files nil
        auto-save-default nil
        load-prefer-newer t)

  ;; UTF-8 everywhere
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") #'keyboard-escape-quit)

  ;; Don’t let package.el auto-enable itself (we use straight.el)
  (setq package-enable-at-startup nil)


  ;; straight.el bootstrap + use-package integration
  (defvar bootstrap-version)
  (let* ((user-dir user-emacs-directory)
         (bootstrap-file
          (expand-file-name "straight/repos/straight.el/bootstrap.el" user-dir)))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Install use-package via straight and make it the default installer
  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)
  (require 'use-package)

  ;; Housekeeping
  (use-package no-littering
    :config
    (setq auto-save-file-name-transforms
          `((".*" ,(no-littering-expand-var-file-name "auto-save/") t))))

  ;; Optional: Weekly straight update + lock versions at 09:00
  (add-hook 'emacs-startup-hook
            (lambda ()
              (run-at-time "09:00" (* 7 24 60 60)
                           (lambda ()
                             (message "Straight: pulling all & freezing versions…")
                             (straight-pull-all)
                             (straight-freeze-versions)
                             (message "Straight: done.")))))

  ;; Ensure environment variables inside Emacs look the same as in the shell.
  (use-package exec-path-from-shell
    :init)
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize))
  (when (daemonp)
    (exec-path-from-shell-initialize))

  (provide 'core)
#+END_SRC

* Core-Extensions

Core extenstions emacs configuration. Ideally these will be the same across all environments.
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/core-extensions.el
  ;; Enable which-key for keybinding discovery
  (use-package which-key
    :defer 0
    :diminish
    :config
    (which-key-mode))

  ;; Completion and search system
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
    :bind (("C-M-j" . counsel-switch-buffer)
           :map minibuffer-local-map
           ("C-r" . counsel-minibuffer-history))
    :custom
    (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
    :config
    (counsel-mode 1))

  (use-package ivy-rich
    :after counsel
    :init
    (ivy-rich-mode 1))

  ;; Use to prioritize command history based on usage.
  (use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  ;: (prescient-persist-mode 1)
  (ivy-prescient-mode 1))

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+END_SRC

* System & OS Integration

System / OS integration. These could change between environments.
#+BEGIN_SRC emacs-lisp :results value :noweb yes
  ;; Unhide dotfiles.
  (cond
   ((string= <<target-os()>> "archlinux")
    "(setq dired-listing-switches \"-alh --group-directories-first\")")
   ((string= <<target-os()>> "macos")
    "(setq dired-listing-switches \"-alh\")")
   (t "Unknown OS"))
#+END_SRC

#+RESULTS:
: (setq dired-listing-switches "-alh --group-directories-first")

Dired configurations.
#+BEGIN_SRC emacs-lisp :eval never :noweb yes :tangle ./modules/system-os.el
  (use-package dired
    :straight (:type built-in)
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump)))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; Launch apps based on content.
  (use-package dired-open
    :config
    (setq dired-open-extensions
  	'(("png" . "imv")
  	  ("jpg" . "imv")
  	  ("pdf" . "zathura")
  	  ("mp4" . "mpv")
  	  ("mkv" . "mpv")
  	  ("html" . "floorp"))))

  ;; Bind enter to launch associated file app.
  (with-eval-after-load 'dired
  ;; Replace RET behavior
  (define-key dired-mode-map (kbd "RET") #'dired-open-file))


  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode))

  ;; Must have dired extensions
  (use-package peep-dired
    :ensure t
    :bind (:map dired-mode-map
                ("P" . peep-dired))
    :hook (peep-dired-mode . (lambda () (setq-local image-dired-display-image-buffer 'other))))

  (use-package dired-subtree
    :ensure t
    :bind (:map dired-mode-map
                ("<tab>" . dired-subtree-toggle)))
#+END_SRC

Terminal
#+BEGIN_SRC emacs-lisp :eval never :tangle ./modules/system-os.el
  (use-package vterm
    :commands vterm
    :bind ("C-c v" . vterm)
    :config
    (setq vterm-shell "/usr/bin/fish")
    (setq vterm-max-scrollback 10000))
#+END_SRC

* Remote Connections

Connections to my remote machines.
#+BEGIN_SRC emacs-lisp :eval never :results silent :tangle ./modules/remote.el
  ;;Debug statements
  ;;(setq tramp-verbose 10)
  ;;(setq tramp-debug-buffer t)

  (defun remote/dired-pi-5 ()
    "Open Dired in home directory on pi-5."
    (interactive)
    (dired "/ssh:username@192.168.1.57:/home/username/"))

  (defun remote/dired-lenovo ()
    "Open Dired in home directory on lenovo."
    (interactive)
    (dired "/ssh:username@192.168.1.80:/home/username/"))

  (defun remote/dired-dell ()
    "Open Dired in home directory on dell."
    (interactive)
    (dired "/ssh:username@192.168.1.108:/home/username/"))
#+END_SRC

